Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB206.h
#define _CNEN1_CN13IE_POSITION                   0x0000000D
#define _CNEN1_CN13IE_MASK                       0x00002000
#define _CNEN1_CN13IE_LENGTH                     0x00000001

#define _CNEN1_CN14IE_POSITION                   0x0000000E
#define _CNEN1_CN14IE_MASK                       0x00004000
#define _CNEN1_CN14IE_LENGTH                     0x00000001

#define _CNEN1_CN15IE_POSITION                   0x0000000F
#define _CNEN1_CN15IE_MASK                       0x00008000
#define _CNEN1_CN15IE_LENGTH                     0x00000001

#define _CNEN2_CN16IE_POSITION                   0x00000000
#define _CNEN2_CN16IE_MASK                       0x00000001
#define _CNEN2_CN16IE_LENGTH                     0x00000001

#define _CNEN2_CN17IE_POSITION                   0x00000001
#define _CNEN2_CN17IE_MASK                       0x00000002
#define _CNEN2_CN17IE_LENGTH                     0x00000001

#define _CNEN2_CN18IE_POSITION                   0x00000002
#define _CNEN2_CN18IE_MASK                       0x00000004
#define _CNEN2_CN18IE_LENGTH                     0x00000001

#define _CNEN2_CN22IE_POSITION                   0x00000006
#define _CNEN2_CN22IE_MASK                       0x00000040
#define _CNEN2_CN22IE_LENGTH                     0x00000001

#define _CNEN2_CN23IE_POSITION                   0x00000007
#define _CNEN2_CN23IE_MASK                       0x00000080
#define _CNEN2_CN23IE_LENGTH                     0x00000001

#define _CNEN2_CN24IE_POSITION                   0x00000008
#define _CNEN2_CN24IE_MASK                       0x00000100
#define _CNEN2_CN24IE_LENGTH                     0x00000001

#define _CNEN2_CN25IE_POSITION                   0x00000009
#define _CNEN2_CN25IE_MASK                       0x00000200
#define _CNEN2_CN25IE_LENGTH                     0x00000001

#define _CNEN2_CN26IE_POSITION                   0x0000000A
#define _CNEN2_CN26IE_MASK                       0x00000400
#define _CNEN2_CN26IE_LENGTH                     0x00000001

#define _CNEN2_CN27IE_POSITION                   0x0000000B
#define _CNEN2_CN27IE_MASK                       0x00000800
#define _CNEN2_CN27IE_LENGTH                     0x00000001

#define _CNEN2_CN28IE_POSITION                   0x0000000C
#define _CNEN2_CN28IE_MASK                       0x00001000
#define _CNEN2_CN28IE_LENGTH                     0x00000001

#define _CNEN2_CN29IE_POSITION                   0x0000000D
#define _CNEN2_CN29IE_MASK                       0x00002000
#define _CNEN2_CN29IE_LENGTH                     0x00000001

#define _CNEN2_CN30IE_POSITION                   0x0000000E
#define _CNEN2_CN30IE_MASK                       0x00004000
#define _CNEN2_CN30IE_LENGTH                     0x00000001

#define _CNEN2_CN31IE_POSITION                   0x0000000F
#define _CNEN2_CN31IE_MASK                       0x00008000
#define _CNEN2_CN31IE_LENGTH                     0x00000001

#define _CNEN3_CN32IE_POSITION                   0x00000000
#define _CNEN3_CN32IE_MASK                       0x00000001
#define _CNEN3_CN32IE_LENGTH                     0x00000001

#define _CNEN4_CN49IE_POSITION                   0x00000001
#define _CNEN4_CN49IE_MASK                       0x00000002
#define _CNEN4_CN49IE_LENGTH                     0x00000001

#define _CNEN4_CN50IE_POSITION                   0x00000002
#define _CNEN4_CN50IE_MASK                       0x00000004
#define _CNEN4_CN50IE_LENGTH                     0x00000001

#define _CNEN4_CN51IE_POSITION                   0x00000003
#define _CNEN4_CN51IE_MASK                       0x00000008
#define _CNEN4_CN51IE_LENGTH                     0x00000001

#define _CNEN4_CN52IE_POSITION                   0x00000004
#define _CNEN4_CN52IE_MASK                       0x00000010
#define _CNEN4_CN52IE_LENGTH                     0x00000001

#define _CNEN4_CN53IE_POSITION                   0x00000005
#define _CNEN4_CN53IE_MASK                       0x00000020
#define _CNEN4_CN53IE_LENGTH                     0x00000001

#define _CNEN4_CN54IE_POSITION                   0x00000006
#define _CNEN4_CN54IE_MASK                       0x00000040
#define _CNEN4_CN54IE_LENGTH                     0x00000001

#define _CNEN4_CN55IE_POSITION                   0x00000007
#define _CNEN4_CN55IE_MASK                       0x00000080
#define _CNEN4_CN55IE_LENGTH                     0x00000001

#define _CNEN4_CN56IE_POSITION                   0x00000008
#define _CNEN4_CN56IE_MASK                       0x00000100
#define _CNEN4_CN56IE_LENGTH                     0x00000001

#define _CNEN4_CN58IE_POSITION                   0x0000000A
#define _CNEN4_CN58IE_MASK                       0x00000400
#define _CNEN4_CN58IE_LENGTH                     0x00000001

#define _CNEN4_CN59IE_POSITION                   0x0000000B
#define _CNEN4_CN59IE_MASK                       0x00000800
#define _CNEN4_CN59IE_LENGTH                     0x00000001

#define _CNEN4_CN60IE_POSITION                   0x0000000C
#define _CNEN4_CN60IE_MASK                       0x00001000
#define _CNEN4_CN60IE_LENGTH                     0x00000001

#define _CNEN4_CN61IE_POSITION                   0x0000000D
#define _CNEN4_CN61IE_MASK                       0x00002000
#define _CNEN4_CN61IE_LENGTH                     0x00000001

#define _CNEN4_CN62IE_POSITION                   0x0000000E
#define _CNEN4_CN62IE_MASK                       0x00004000
#define _CNEN4_CN62IE_LENGTH                     0x00000001

#define _CNEN4_CN63IE_POSITION                   0x0000000F
#define _CNEN4_CN63IE_MASK                       0x00008000
#define _CNEN4_CN63IE_LENGTH                     0x00000001

#define _CNEN5_CN64IE_POSITION                   0x00000000
#define _CNEN5_CN64IE_MASK                       0x00000001
#define _CNEN5_CN64IE_LENGTH                     0x00000001

#define _CNEN5_CN65IE_POSITION                   0x00000001
#define _CNEN5_CN65IE_MASK                       0x00000002
#define _CNEN5_CN65IE_LENGTH                     0x00000001

#define _CNEN5_CN68IE_POSITION                   0x00000004
#define _CNEN5_CN68IE_MASK                       0x00000010
#define _CNEN5_CN68IE_LENGTH                     0x00000001

