Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB206.h
#define _U3STA_UTXINV_POSITION                   0x0000000E
#define _U3STA_UTXINV_MASK                       0x00004000
#define _U3STA_UTXINV_LENGTH                     0x00000001

#define _U3STA_UTXISEL1_POSITION                 0x0000000F
#define _U3STA_UTXISEL1_MASK                     0x00008000
#define _U3STA_UTXISEL1_LENGTH                   0x00000001

#define _U3STA_URXISEL0_POSITION                 0x00000006
#define _U3STA_URXISEL0_MASK                     0x00000040
#define _U3STA_URXISEL0_LENGTH                   0x00000001

#define _U3STA_URXISEL1_POSITION                 0x00000007
#define _U3STA_URXISEL1_MASK                     0x00000080
#define _U3STA_URXISEL1_LENGTH                   0x00000001

#define _U3TXREG_UTXREG0_POSITION                0x00000000
#define _U3TXREG_UTXREG0_MASK                    0x00000001
#define _U3TXREG_UTXREG0_LENGTH                  0x00000001

#define _U3TXREG_UTXREG1_POSITION                0x00000001
#define _U3TXREG_UTXREG1_MASK                    0x00000002
#define _U3TXREG_UTXREG1_LENGTH                  0x00000001

#define _U3TXREG_UTXREG2_POSITION                0x00000002
#define _U3TXREG_UTXREG2_MASK                    0x00000004
#define _U3TXREG_UTXREG2_LENGTH                  0x00000001

#define _U3TXREG_UTXREG3_POSITION                0x00000003
#define _U3TXREG_UTXREG3_MASK                    0x00000008
#define _U3TXREG_UTXREG3_LENGTH                  0x00000001

#define _U3TXREG_UTXREG4_POSITION                0x00000004
#define _U3TXREG_UTXREG4_MASK                    0x00000010
#define _U3TXREG_UTXREG4_LENGTH                  0x00000001

#define _U3TXREG_UTXREG5_POSITION                0x00000005
#define _U3TXREG_UTXREG5_MASK                    0x00000020
#define _U3TXREG_UTXREG5_LENGTH                  0x00000001

#define _U3TXREG_UTXREG6_POSITION                0x00000006
#define _U3TXREG_UTXREG6_MASK                    0x00000040
#define _U3TXREG_UTXREG6_LENGTH                  0x00000001

#define _U3TXREG_UTXREG7_POSITION                0x00000007
#define _U3TXREG_UTXREG7_MASK                    0x00000080
#define _U3TXREG_UTXREG7_LENGTH                  0x00000001

#define _U3TXREG_UTXREG8_POSITION                0x00000008
#define _U3TXREG_UTXREG8_MASK                    0x00000100
#define _U3TXREG_UTXREG8_LENGTH                  0x00000001

#define _U3RXREG_URXREG0_POSITION                0x00000000
#define _U3RXREG_URXREG0_MASK                    0x00000001
#define _U3RXREG_URXREG0_LENGTH                  0x00000001

#define _U3RXREG_URXREG1_POSITION                0x00000001
#define _U3RXREG_URXREG1_MASK                    0x00000002
#define _U3RXREG_URXREG1_LENGTH                  0x00000001

#define _U3RXREG_URXREG2_POSITION                0x00000002
#define _U3RXREG_URXREG2_MASK                    0x00000004
#define _U3RXREG_URXREG2_LENGTH                  0x00000001

#define _U3RXREG_URXREG3_POSITION                0x00000003
#define _U3RXREG_URXREG3_MASK                    0x00000008
#define _U3RXREG_URXREG3_LENGTH                  0x00000001

#define _U3RXREG_URXREG4_POSITION                0x00000004
#define _U3RXREG_URXREG4_MASK                    0x00000010
#define _U3RXREG_URXREG4_LENGTH                  0x00000001

#define _U3RXREG_URXREG5_POSITION                0x00000005
#define _U3RXREG_URXREG5_MASK                    0x00000020
#define _U3RXREG_URXREG5_LENGTH                  0x00000001

#define _U3RXREG_URXREG6_POSITION                0x00000006
#define _U3RXREG_URXREG6_MASK                    0x00000040
#define _U3RXREG_URXREG6_LENGTH                  0x00000001

#define _U3RXREG_URXREG7_POSITION                0x00000007
#define _U3RXREG_URXREG7_MASK                    0x00000080
#define _U3RXREG_URXREG7_LENGTH                  0x00000001

#define _U3RXREG_URXREG8_POSITION                0x00000008
#define _U3RXREG_URXREG8_MASK                    0x00000100
#define _U3RXREG_URXREG8_LENGTH                  0x00000001

#define _SPI2STAT_SPIRBF_POSITION                0x00000000
#define _SPI2STAT_SPIRBF_MASK                    0x00000001
#define _SPI2STAT_SPIRBF_LENGTH                  0x00000001

#define _SPI2STAT_SPITBF_POSITION                0x00000001
#define _SPI2STAT_SPITBF_MASK                    0x00000002
#define _SPI2STAT_SPITBF_LENGTH                  0x00000001

#define _SPI2STAT_SISEL_POSITION                 0x00000002
#define _SPI2STAT_SISEL_MASK                     0x0000001C
#define _SPI2STAT_SISEL_LENGTH                   0x00000003

#define _SPI2STAT_SRXMPT_POSITION                0x00000005
#define _SPI2STAT_SRXMPT_MASK                    0x00000020
#define _SPI2STAT_SRXMPT_LENGTH                  0x00000001

#define _SPI2STAT_SPIROV_POSITION                0x00000006
#define _SPI2STAT_SPIROV_MASK                    0x00000040
#define _SPI2STAT_SPIROV_LENGTH                  0x00000001

#define _SPI2STAT_SRMPT_POSITION                 0x00000007
#define _SPI2STAT_SRMPT_MASK                     0x00000080
#define _SPI2STAT_SRMPT_LENGTH                   0x00000001

#define _SPI2STAT_SPIBEC_POSITION                0x00000008
#define _SPI2STAT_SPIBEC_MASK                    0x00000700
#define _SPI2STAT_SPIBEC_LENGTH                  0x00000003

#define _SPI2STAT_SPISIDL_POSITION               0x0000000D
#define _SPI2STAT_SPISIDL_MASK                   0x00002000
#define _SPI2STAT_SPISIDL_LENGTH                 0x00000001

#define _SPI2STAT_SPIEN_POSITION                 0x0000000F
#define _SPI2STAT_SPIEN_MASK                     0x00008000
#define _SPI2STAT_SPIEN_LENGTH                   0x00000001

#define _SPI2STAT_SISEL0_POSITION                0x00000002
#define _SPI2STAT_SISEL0_MASK                    0x00000004
#define _SPI2STAT_SISEL0_LENGTH                  0x00000001

#define _SPI2STAT_SISEL1_POSITION                0x00000003
#define _SPI2STAT_SISEL1_MASK                    0x00000008
#define _SPI2STAT_SISEL1_LENGTH                  0x00000001

#define _SPI2STAT_SISEL2_POSITION                0x00000004
#define _SPI2STAT_SISEL2_MASK                    0x00000010
#define _SPI2STAT_SISEL2_LENGTH                  0x00000001

