Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB206.h
#define _U4STA_URXISEL_POSITION                  0x00000006
#define _U4STA_URXISEL_MASK                      0x000000C0
#define _U4STA_URXISEL_LENGTH                    0x00000002

#define _U4STA_TRMT_POSITION                     0x00000008
#define _U4STA_TRMT_MASK                         0x00000100
#define _U4STA_TRMT_LENGTH                       0x00000001

#define _U4STA_UTXBF_POSITION                    0x00000009
#define _U4STA_UTXBF_MASK                        0x00000200
#define _U4STA_UTXBF_LENGTH                      0x00000001

#define _U4STA_UTXEN_POSITION                    0x0000000A
#define _U4STA_UTXEN_MASK                        0x00000400
#define _U4STA_UTXEN_LENGTH                      0x00000001

#define _U4STA_UTXBRK_POSITION                   0x0000000B
#define _U4STA_UTXBRK_MASK                       0x00000800
#define _U4STA_UTXBRK_LENGTH                     0x00000001

#define _U4STA_UTXISEL0_POSITION                 0x0000000D
#define _U4STA_UTXISEL0_MASK                     0x00002000
#define _U4STA_UTXISEL0_LENGTH                   0x00000001

#define _U4STA_UTXINV_POSITION                   0x0000000E
#define _U4STA_UTXINV_MASK                       0x00004000
#define _U4STA_UTXINV_LENGTH                     0x00000001

#define _U4STA_UTXISEL1_POSITION                 0x0000000F
#define _U4STA_UTXISEL1_MASK                     0x00008000
#define _U4STA_UTXISEL1_LENGTH                   0x00000001

#define _U4STA_URXISEL0_POSITION                 0x00000006
#define _U4STA_URXISEL0_MASK                     0x00000040
#define _U4STA_URXISEL0_LENGTH                   0x00000001

#define _U4STA_URXISEL1_POSITION                 0x00000007
#define _U4STA_URXISEL1_MASK                     0x00000080
#define _U4STA_URXISEL1_LENGTH                   0x00000001

#define _U4TXREG_UTXREG0_POSITION                0x00000000
#define _U4TXREG_UTXREG0_MASK                    0x00000001
#define _U4TXREG_UTXREG0_LENGTH                  0x00000001

#define _U4TXREG_UTXREG1_POSITION                0x00000001
#define _U4TXREG_UTXREG1_MASK                    0x00000002
#define _U4TXREG_UTXREG1_LENGTH                  0x00000001

#define _U4TXREG_UTXREG2_POSITION                0x00000002
#define _U4TXREG_UTXREG2_MASK                    0x00000004
#define _U4TXREG_UTXREG2_LENGTH                  0x00000001

#define _U4TXREG_UTXREG3_POSITION                0x00000003
#define _U4TXREG_UTXREG3_MASK                    0x00000008
#define _U4TXREG_UTXREG3_LENGTH                  0x00000001

#define _U4TXREG_UTXREG4_POSITION                0x00000004
#define _U4TXREG_UTXREG4_MASK                    0x00000010
#define _U4TXREG_UTXREG4_LENGTH                  0x00000001

#define _U4TXREG_UTXREG5_POSITION                0x00000005
#define _U4TXREG_UTXREG5_MASK                    0x00000020
#define _U4TXREG_UTXREG5_LENGTH                  0x00000001

#define _U4TXREG_UTXREG6_POSITION                0x00000006
#define _U4TXREG_UTXREG6_MASK                    0x00000040
#define _U4TXREG_UTXREG6_LENGTH                  0x00000001

#define _U4TXREG_UTXREG7_POSITION                0x00000007
#define _U4TXREG_UTXREG7_MASK                    0x00000080
#define _U4TXREG_UTXREG7_LENGTH                  0x00000001

#define _U4TXREG_UTXREG8_POSITION                0x00000008
#define _U4TXREG_UTXREG8_MASK                    0x00000100
#define _U4TXREG_UTXREG8_LENGTH                  0x00000001

#define _U4RXREG_URXREG0_POSITION                0x00000000
#define _U4RXREG_URXREG0_MASK                    0x00000001
#define _U4RXREG_URXREG0_LENGTH                  0x00000001

#define _U4RXREG_URXREG1_POSITION                0x00000001
#define _U4RXREG_URXREG1_MASK                    0x00000002
#define _U4RXREG_URXREG1_LENGTH                  0x00000001

#define _U4RXREG_URXREG2_POSITION                0x00000002
#define _U4RXREG_URXREG2_MASK                    0x00000004
#define _U4RXREG_URXREG2_LENGTH                  0x00000001

#define _U4RXREG_URXREG3_POSITION                0x00000003
#define _U4RXREG_URXREG3_MASK                    0x00000008
#define _U4RXREG_URXREG3_LENGTH                  0x00000001

#define _U4RXREG_URXREG4_POSITION                0x00000004
#define _U4RXREG_URXREG4_MASK                    0x00000010
#define _U4RXREG_URXREG4_LENGTH                  0x00000001

#define _U4RXREG_URXREG5_POSITION                0x00000005
#define _U4RXREG_URXREG5_MASK                    0x00000020
#define _U4RXREG_URXREG5_LENGTH                  0x00000001

#define _U4RXREG_URXREG6_POSITION                0x00000006
#define _U4RXREG_URXREG6_MASK                    0x00000040
#define _U4RXREG_URXREG6_LENGTH                  0x00000001

#define _U4RXREG_URXREG7_POSITION                0x00000007
#define _U4RXREG_URXREG7_MASK                    0x00000080
#define _U4RXREG_URXREG7_LENGTH                  0x00000001

#define _U4RXREG_URXREG8_POSITION                0x00000008
#define _U4RXREG_URXREG8_MASK                    0x00000100
#define _U4RXREG_URXREG8_LENGTH                  0x00000001

#define _TRISB_TRISB0_POSITION                   0x00000000
#define _TRISB_TRISB0_MASK                       0x00000001
#define _TRISB_TRISB0_LENGTH                     0x00000001

#define _TRISB_TRISB1_POSITION                   0x00000001
#define _TRISB_TRISB1_MASK                       0x00000002
#define _TRISB_TRISB1_LENGTH                     0x00000001

#define _TRISB_TRISB2_POSITION                   0x00000002
#define _TRISB_TRISB2_MASK                       0x00000004
#define _TRISB_TRISB2_LENGTH                     0x00000001

#define _TRISB_TRISB3_POSITION                   0x00000003
#define _TRISB_TRISB3_MASK                       0x00000008
#define _TRISB_TRISB3_LENGTH                     0x00000001

#define _TRISB_TRISB4_POSITION                   0x00000004
#define _TRISB_TRISB4_MASK                       0x00000010
#define _TRISB_TRISB4_LENGTH                     0x00000001

#define _TRISB_TRISB5_POSITION                   0x00000005
#define _TRISB_TRISB5_MASK                       0x00000020
#define _TRISB_TRISB5_LENGTH                     0x00000001

#define _TRISB_TRISB6_POSITION                   0x00000006
#define _TRISB_TRISB6_MASK                       0x00000040
#define _TRISB_TRISB6_LENGTH                     0x00000001

#define _TRISB_TRISB7_POSITION                   0x00000007
#define _TRISB_TRISB7_MASK                       0x00000080
#define _TRISB_TRISB7_LENGTH                     0x00000001

#define _TRISB_TRISB8_POSITION                   0x00000008
#define _TRISB_TRISB8_MASK                       0x00000100
#define _TRISB_TRISB8_LENGTH                     0x00000001

#define _TRISB_TRISB9_POSITION                   0x00000009
#define _TRISB_TRISB9_MASK                       0x00000200
#define _TRISB_TRISB9_LENGTH                     0x00000001

#define _TRISB_TRISB10_POSITION                  0x0000000A
#define _TRISB_TRISB10_MASK                      0x00000400
#define _TRISB_TRISB10_LENGTH                    0x00000001

#define _TRISB_TRISB11_POSITION                  0x0000000B
#define _TRISB_TRISB11_MASK                      0x00000800
#define _TRISB_TRISB11_LENGTH                    0x00000001

